{
  "data": [
    { "que": "What are manufacturing industries?", "ans": "Industries that transform raw materials into finished goods through processing and production." },
    { "que": "Differentiate small-scale and large-scale industries.", "ans": "Small-scale use less capital and labour (e.g., village industries); large-scale use heavy machinery and capital (e.g., steel plants)." },
    { "que": "What is agro-based industry?", "ans": "Industries using agricultural raw materials like sugar, edible oils and textiles." },
    { "que": "What is mineral-based industry?", "ans": "Industries using minerals as raw materials like steel and cement factories." },
    { "que": "Why is location important for industries?", "ans": "Affects access to raw materials, markets, labour and transport costs which determine profitability." },
    { "que": "What are footloose industries?", "ans": "Industries that can be located anywhere because raw material and market constraints are minimal, e.g., electronics." },
    { "que": "What is industrial agglomeration?", "ans": "Concentration of industries in a region to share resources, labour and infrastructure." },
    { "que": "Name a public sector industry in India.", "ans": "Steel Authority of India (SAIL) or Indian Oil Corporation." },
    { "que": "Why are special economic zones (SEZs) created?", "ans": "To promote exports by providing tax and infrastructure incentives to industries." },
    { "que": "What is labour-intensive industry?", "ans": "Industries that require large amounts of human labour relative to capital, e.g., garments." },
    { "que": "What is capital-intensive industry?", "ans": "Industries requiring high capital investment in machinery and equipment, e.g., automobile plants." },
    { "que": "How do industries affect environment?", "ans": "Cause air and water pollution, waste generation and resource depletion if not regulated." },
    { "que": "What is the role of technology in manufacturing?", "ans": "Increases productivity, quality and efficiency while reducing costs." },
    { "que": "What is cottage industry?", "ans": "Small-scale, home-based manufacture using family labour and traditional methods." },
    { "que": "Why is infrastructure crucial for industry?", "ans": "Reliable energy, transport and water services reduce costs and improve production." },
    { "que": "What is perishability and which industry is affected?", "ans": "Products that spoil quickly; food processing needs cold chains to prevent spoilage." },
    { "que": "What are export-oriented industries?", "ans": "Industries primarily producing goods for foreign markets to earn foreign exchange." },
    { "que": "What is backward linkage?", "ans": "Industries that supply raw materials and inputs to other industries upstream." },
    { "que": "What is forward linkage?", "ans": "Industries that use outputs of other industries to add value downstream." },
    { "que": "How does government policy influence industries?", "ans": "Through subsidies, tariffs, regulations, incentives and infrastructure support." },
    { "que": "What is the importance of skill development for industries?", "ans": "Skilled workforce improves productivity, product quality and innovation." },
    { "que": "Name a manufacturing cluster in India.", "ans": "Tiruppur for textiles or Jamshedpur for steel/manufacturing." },
    { "que": "What is outsourcing in manufacturing?", "ans": "Contracting parts of production or services to external firms to reduce costs and focus on core tasks." },
    { "que": "What is the environmental regulation for industries?", "ans": "Standards and permits for emissions, effluent treatment and waste management." },
    { "que": "Why promote small industries?", "ans": "They generate employment, use local resources and reduce regional disparities." },
    { "que": "What is industrial policy?", "ans": "Government strategy to guide industrial development, sectoral focus and investment incentives." },
    { "que": "How do transport costs affect industrial location?", "ans": "High transport costs can push industries closer to raw materials or markets depending on weight changes." },
    { "que": "What is the role of MSMEs in economy?", "ans": "Create jobs, contribute to production and exports, and support large industries as suppliers." },
    { "que": "What is product life cycle's effect on manufacturing?", "ans": "Products go through introduction to decline phases affecting production scale and technology needs." },
    { "que": "What is the significance of quality standards for industry?", "ans": "Ensure market access, consumer safety and competitiveness in domestic and international markets." }
  ]
}
