{
  "data": [
    { "que": "What triggered the 1857 uprising in India?", "ans": "A variety of grievances including military, political, economic, and social causes; the immediate spark was the cartridge controversy in the army." },
    { "que": "Who was Bahadur Shah Zafar?", "ans": "The last Mughal emperor who became a symbolic leader of the 1857 revolt." },
    { "que": "What was the Indian National Congress (INC)?", "ans": "A political organization founded in 1885 to voice Indian demands and work for self-government." },
    { "que": "Name two early leaders of the INC.", "ans": "Dadabhai Naoroji and Gopal Krishna Gokhale." },
    { "que": "What did the Swadeshi movement promote?", "ans": "Boycott of British goods and promotion of indigenous industries and goods." },
    { "que": "Who started the Non-Cooperation Movement?", "ans": "Mahatma Gandhi in 1920 as a mass movement against British rule." },
    { "que": "What was the Rowlatt Act?", "ans": "A 1919 law allowing detention without trial, which led to widespread protests." },
    { "que": "What happened at Jallianwala Bagh?", "ans": "In 1919 British troops fired on unarmed civilians gathered in Amritsar, killing many." },
    { "que": "Who led the Salt Satyagraha (Dandi March)?", "ans": "Mahatma Gandhi in 1930 to protest the salt tax." },
    { "que": "What was the demand in the Quit India Movement?", "ans": "Immediate British withdrawal from India (launched in 1942)." },
    { "que": "Define Satyagraha.", "ans": "A policy of nonviolent resistance or civil disobedience championed by Gandhi." },
    { "que": "What was the role of women in the freedom movement?", "ans": "Women participated in protests, marches, and leadership roles, e.g., Sarojini Naidu." },
    { "que": "Who was Subhas Chandra Bose?", "ans": "A radical nationalist leader who sought armed struggle and led the Indian National Army (INA)." },
    { "que": "What was the significance of the Lucknow Pact?", "ans": "An agreement (1916) between Congress and the Muslim League on joint demands and separate electorates." },
    { "que": "What was the objective of the Home Rule Movement?", "ans": "To demand self-governance within the British Empire, led by Tilak and Annie Besant." },
    { "que": "Name an economic impact of British colonialism on India.", "ans": "Deindustrialization of traditional industries and drain of wealth to Britain." },
    { "que": "What was the Simon Commission?", "ans": "A 1927 British commission to review constitutional reform that excluded Indian members and faced protests." },
    { "que": "Why did the Khilafat Movement ally with Congress?", "ans": "Shared anti-British goals and to build Hindu-Muslim unity after World War I." },
    { "que": "What was the impact of World War I on Indian nationalism?", "ans": "It raised political expectations and economic strain, leading to increased demands for self-rule." },
    { "que": "What is communalism in the Indian context?", "ans": "Political mobilization along religious lines, often leading to division between communities." },
    { "que": "Who were moderate and extremist leaders in INC?", "ans": "Moderates sought gradual reform (e.g., Gokhale); extremists wanted direct action (e.g., Tilak)." },
    { "que": "How did the partition of Bengal (1905) affect nationalism?", "ans": "It sparked the Swadeshi movement and intensified anti-colonial activism." },
    { "que": "What role did peasants play in the freedom movement?", "ans": "They participated in protests and local movements, sometimes driven by economic grievances." },
    { "que": "What was the Cabinet Mission Plan (1946)?", "ans": "A British proposal to transfer power and create a federal arrangement in India; ultimately failed to prevent partition." },
    { "que": "Name one reason for the rise of communal politics before independence.", "ans": "Colonial policies, separate electorates, and competing political aspirations among communities." },
    { "que": "What is civil disobedience?", "ans": "Deliberate and public refusal to obey unjust laws as a form of protest." },
    { "que": "Who wrote 'Poverty and Un-British Rule in India'?", "ans": "Dadabhai Naoroji (book highlighted economic exploitation)." },
    { "que": "What was the significance of the Cripps Mission (1942)?", "ans": "A failed British attempt to secure Indian cooperation in WWII by promising future dominion status." }
  ]
}