{
  "data": [
    { "que": "What is gender as a social category?", "ans": "A set of social and cultural distinctions associated with being male or female, not just biological sex." },
    { "que": "Define communalism.", "ans": "An ideology that treats religious or ethnic communities as primary political units and often seeks their political advantage." },
    { "que": "What is caste?", "ans": "A hierarchical social group based on birth, traditionally determining occupation and social status in India." },
    { "que": "How does patriarchy shape gender relations?", "ans": "By privileging male authority in family, society, and institutions, limiting women's rights and opportunities." },
    { "que": "What is secularism?", "ans": "A state policy of neutrality toward religions, ensuring equal treatment of all faiths." },
    { "que": "What are affirmative actions?", "ans": "Policies like reservations aimed at correcting historical disadvantages faced by certain groups." },
    { "que": "How do social movements challenge caste discrimination?", "ans": "They mobilize for legal reform, social equality, education and political representation for oppressed groups." },
    { "que": "What is the impact of religion on politics?", "ans": "Religion can shape political identities, mobilize voters, and influence policy debates and parties." },
    { "que": "What is gender mainstreaming?", "ans": "Integrating gender perspectives into policymaking and programs to ensure equality in outcomes." },
    { "que": "How does caste-based politics operate?", "ans": "Political parties mobilize voters using caste identities, promising representation and benefits to specific groups." },
    { "que": "What is an example of communal politics leading to violence?", "ans": "Riots between religious communities over contested issues or provocations leading to mass violence." },
    { "que": "What legal measures protect gender rights in India?", "ans": "Laws against dowry, domestic violence, sexual harassment and laws promoting equal rights and reservations in local bodies." },
    { "que": "How can education reduce caste and gender discrimination?", "ans": "By promoting awareness, skills, mobility, and challenging prejudices through inclusive curricula." },
    { "que": "What is intersectionality?", "ans": "How different identities (gender, caste, class, religion) overlap to shape unique experiences of discrimination." },
    { "que": "Why do some groups demand separate religious laws?", "ans": "To preserve community customs, but such demands can conflict with equal rights principles." },
    { "que": "What is social exclusion?", "ans": "Processes by which certain groups are marginalized from access to resources and opportunities." },
    { "que": "How has urbanization affected caste relations?", "ans": "Migration and economic change have blurred some caste boundaries but discrimination persists in new forms." },
    { "que": "What role do women's movements play in politics?", "ans": "They advocate legal reforms, rights, representation, and social change for gender equality." },
    { "que": "What is reservation policy?", "ans": "Affirmative action providing quotas in education and public employment for disadvantaged castes and tribes." },
    { "que": "How does communalism undermine democracy?", "ans": "By promoting majoritarian claims, polarizing voters and weakening secular institutions." },
    { "que": "What measures counter communal politics?", "ans": "Strong legal protections, secular education, interfaith dialogue, and inclusive political practices." },
    { "que": "Why are identity-based grievances politically mobilized?", "ans": "Leaders use identity to build support, promise targeted benefits, and address perceived injustices." },
    { "que": "What is gender stereotyping?", "ans": "Simplistic beliefs about traits, roles or abilities considered appropriate for men and women." },
    { "que": "How can law promote social equality?", "ans": "By outlawing discrimination, enforcing rights, and creating institutions for redress and welfare." },
    { "que": "What are the political consequences of caste inequalities?", "ans": "They shape voting patterns, party formation, and demands for redistribution and representation." },
    { "que": "What is the role of media in addressing communalism?", "ans": "Media can expose divisive politics, promote dialogue, or sometimes inflame tensions depending on coverage." },
    { "que": "How do economic changes affect gender roles?", "ans": "Employment opportunities and education can alter traditional roles but may also lead to new inequalities." },
    { "que": "What is the importance of intersectional policies?", "ans": "They recognize multiple disadvantages and design targeted interventions for overlapping marginalities." }
  ]
}