{
  "data": [
    { "que": "What are forests?", "ans": "Large areas dominated by trees and other vegetation providing ecological and economic benefits." },
    { "que": "Name one ecological function of forests.", "ans": "Maintain biodiversity and regulate climate through carbon sequestration." },
    { "que": "What is wildlife?", "ans": "Non-domesticated animals, birds, and other organisms living in natural habitats." },
    { "que": "Why are forests important for water cycle?", "ans": "They aid in rainfall generation, groundwater recharge and prevent runoff." },
    { "que": "What causes deforestation?", "ans": "Agricultural expansion, logging, urbanisation and infrastructure projects." },
    { "que": "What are protected areas?", "ans": "Designated regions like national parks and sanctuaries for conservation of wildlife." },
    { "que": "What is biodiversity hotspot?", "ans": "Regions with high species richness under threat of habitat loss." },
    { "que": "Why conserve wildlife?", "ans": "For ecological balance, genetic diversity and cultural and economic values." },
    { "que": "What is afforestation?", "ans": "Planting trees on lands that were not previously forested to increase tree cover." },
    { "que": "What is reforestation?", "ans": "Replanting trees in deforested areas to restore forests." },
    { "que": "What is shifting cultivation?", "ans": "Traditional farming where land is cleared, farmed briefly, then left fallow; can lead to forest loss." },
    { "que": "What is sustainable forest management?", "ans": "Managing forests to meet current needs without compromising future productivity or biodiversity." },
    { "que": "What is the role of local communities in conservation?", "ans": "They protect habitats using traditional practices and participate in decision-making." },
    { "que": "What is poaching?", "ans": "Illegal hunting or capturing of wildlife for trade or consumption." },
    { "que": "Name a wildlife conservation law in India.", "ans": "The Wildlife (Protection) Act, 1972." },
    { "que": "What are biosphere reserves?", "ans": "Areas promoting conservation with sustainable use and research across core, buffer and transition zones." },
    { "que": "What is habitat fragmentation?", "ans": "Breaking of habitats into smaller patches, reducing connectivity and species survival." },
    { "que": "How do forests help control erosion?", "ans": "Tree roots bind soil, reducing surface runoff and preventing landslides." },
    { "que": "What is the impact of invasive species?", "ans": "They outcompete native species and disrupt ecosystems." },
    { "que": "What is community-based conservation?", "ans": "Conservation involving local people in protecting and managing natural resources." },
    { "que": "Why maintain gene pools?", "ans": "To preserve genetic diversity for future breeding and adaptation." },
    { "que": "What is ex-situ conservation?", "ans": "Protecting species outside natural habitats, e.g., zoos and seed banks." },
    { "que": "What is in-situ conservation?", "ans": "Protecting species within their natural habitats like national parks." },
    { "que": "How does illegal logging affect forests?", "ans": "Removes trees unsustainably, degrading habitat and reducing biodiversity." },
    { "que": "What is the role of afforestation in climate mitigation?", "ans": "Absorbs CO2 and helps reduce greenhouse gas concentrations." },
    { "que": "What is overgrazing's effect on forests?", "ans": "Prevents regeneration, causing soil erosion and vegetation loss." },
    { "que": "What are migratory species?", "ans": "Species that move seasonally between habitats for breeding or feeding." },
    { "que": "Why are wetlands important for wildlife?", "ans": "Provide habitat for many species and support biodiversity and water purification." },
    { "que": "What is the significance of corridors in conservation?", "ans": "They connect fragmented habitats allowing species movement and gene flow." },
    { "que": "Give one eco-friendly livelihood linked to forests.", "ans": "Sustainable collection of non-timber forest products like honey and medicinal plants." }
  ]
}
