{
  "data": [
    { "que": "What is heredity?", "ans": "Passing of traits from parents to offspring." },
    { "que": "Who is known as the father of genetics?", "ans": "Gregory Mendel." },
    { "que": "Define gene.", "ans": "A unit of heredity made of DNA that determines a trait." },
    { "que": "What is an allele?", "ans": "Alternative form of a gene at the same locus." },
    { "que": "Differentiate between genotype and phenotype.", "ans": "Genotype is genetic makeup; phenotype is observable traits." },
    { "que": "What is dominant and recessive trait?", "ans": "Dominant expresses in heterozygote; recessive expresses only when homozygous." },
    { "que": "State Mendel's law of segregation.", "ans": "Alleles segregate during gamete formation so each gamete carries one allele." },
    { "que": "What is a monohybrid cross?", "ans": "Cross involving one pair of contrasting traits." },
    { "que": "What is a dihybrid cross?", "ans": "Cross between parents differing in two traits." },
    { "que": "What is mutation?", "ans": "A change in the DNA sequence leading to genetic variation." },
    { "que": "What is natural selection?", "ans": "Process where favourable traits become more common over generations." },
    { "que": "What is variation?", "ans": "Differences among individuals of a species." },
    { "que": "How are sex of human offspring determined?", "ans": "By sperm carrying X or Y chromosome; female is XX, male is XY." },
    { "que": "What is evolution?", "ans": "Change in heritable characteristics of populations over generations." },
    { "que": "Name one evidence for evolution.", "ans": "Fossil records showing gradual changes over time." },
    { "que": "What are homologous organs?", "ans": "Organs with similar structure but different functions indicating common ancestry." },
    { "que": "What are analogous organs?", "ans": "Similar function but different structure; no common ancestry." },
    { "que": "Give an example of homologous organs.", "ans": "Forelimbs of humans, wings of bats, and flippers of whales." },
    { "que": "What is selective breeding?", "ans": "Humans breed plants/animals to obtain desired traits." },
    { "que": "What is speciation?", "ans": "Formation of new species from existing ones due to isolation and evolution." },
    { "que": "How does genetic drift affect populations?", "ans": "Random changes in allele frequency can reduce genetic variation." },
    { "que": "What role do mutations play in evolution?", "ans": "Provide new genetic variations that can be acted on by natural selection." },
    { "que": "What is a pedigree chart?", "ans": "Diagram showing inheritance of a trait across generations." },
    { "que": "Define fossilisation briefly.", "ans": "Process where remains of organisms are preserved in rock." },
    { "que": "Why is variation important for survival?", "ans": "It allows adaptation to changing environments and survival advantage." },
    { "que": "Give one example of natural selection in action.", "ans": "Antibiotic resistance in bacteria increases due to selection pressure." }
  ]
}
