{
  "data": [
    { "que": "What is globalization?", "ans": "The process of increasing interconnectedness of economies, societies, and cultures across the world." },
    { "que": "Name one factor that facilitated early modern global trade.", "ans": "Maritime exploration and advances in navigation." },
    { "que": "What role did colonies play in global trade?", "ans": "They provided raw materials and markets for European manufactured goods." },
    { "que": "Define mercantilism.", "ans": "An economic policy where colonies supply raw materials to the mother country and serve as markets for finished goods." },
    { "que": "What was the impact of the Industrial Revolution on global trade?", "ans": "It increased production and demand for raw materials, expanding global trade networks." },
    { "que": "What were cash crops?", "ans": "Crops grown for sale in distant markets rather than local consumption, e.g., cotton, sugar." },
    { "que": "How did steamships and railways influence globalization?", "ans": "They reduced travel time and transport costs, integrating markets and facilitating movement." },
    { "que": "What was the significance of the Suez Canal (1869)?", "ans": "It shortened sea routes between Europe and Asia, boosting trade and imperial control." },
    { "que": "Define 'unequal exchange'.", "ans": "Trade where colonies exported raw materials and imported expensive manufactured goods, disadvantaging local economies." },
    { "que": "How did migration contribute to global connections?", "ans": "Labor migration spread people, skills, and cultures, linking different regions economically and socially." },
    { "que": "What is the world economy?", "ans": "A system of economic interdependence connecting production, trade, and finance across countries." },
    { "que": "What role did multinational companies play in globalization?", "ans": "They invested and operated across borders, shaping trade, production, and consumption patterns." },
    { "que": "What was the Opium trade's impact on China?", "ans": "It led to widespread addiction, social disruption, and the Opium Wars that weakened China." },
    { "que": "How did colonization affect indigenous industries?", "ans": "Many traditional industries declined due to cheap imports and colonial policies favoring metropolitan industries." },
    { "que": "What was the Gold Standard?", "ans": "A monetary system where currency value was linked to a specified amount of gold, facilitating international trade." },
    { "que": "Why did the world economy face crises in the 19th century?", "ans": "Overproduction, speculative finance, and unequal distribution of wealth led to periodic economic crises." },
    { "que": "What is cultural exchange in the context of globalization?", "ans": "The sharing of ideas, languages, foods, and practices among different societies." },
    { "que": "How did abolition of slavery affect global labour systems?", "ans": "It changed labor sources, leading to indentured labor migration from Asia to plantations." },
    { "que": "What were indentured laborers?", "ans": "Workers contracted to work for a set period in distant colonies, often under harsh conditions." },
    { "que": "Give an example of technological diffusion across the globe.", "ans": "Spread of telegraph networks and railway technology from Europe to colonies." },
    { "que": "What is free trade?", "ans": "Trade without tariffs or restrictions between countries to encourage exchange." },
    { "que": "How did imperialism shape the global economy?", "ans": "Imperial powers controlled resources and markets, directing global flows to benefit metropolitan industries." },
    { "que": "What role did ports and trading posts play?", "ans": "They served as nodes for exchange, administration, and cultural interaction." },
    { "que": "What was the significance of the telegraph?", "ans": "It enabled near-instant communication across long distances, coordinating trade and governance." },
    { "que": "How did global consumption patterns change in the 19th century?", "ans": "Demand for new commodities like tea, sugar, and cotton grew across the world." },
    { "que": "What is decolonization?", "ans": "The process by which colonies gained independence from imperial powers in the 20th century." },
    { "que": "Why did some regions industrialize later than others?", "ans": "Differences in resources, capital, political stability, and access to technology affected industrialization timing." },
    { "que": "What was the role of finance in globalization?", "ans": "Banks and investment flows funded trade, infrastructure, and colonial expansion." }
  ]
}