{
  "data": [
    { "que": "What are 'challenges to democracy'?", "ans": "Problems that hinder democratic functioning such as corruption, communalism, inequality and weak institutions." },
    { "que": "Define corruption in public life.", "ans": "Misuse of public office for private gain, including bribery and embezzlement." },
    { "que": "What is communalism as a challenge?", "ans": "Politics that appeals to religious identities and can divide society and incite violence." },
    { "que": "How does caste function as a challenge to democracy?", "ans": "Caste-based inequalities and vote-bank politics can fragment social unity and distort representation." },
    { "que": "What is regionalism?", "ans": "When regional interests override national concerns, sometimes causing separatist demands or friction with the centre." },
    { "que": "Explain money power in elections.", "ans": "Use of large financial resources to influence election outcomes and buy support or visibility." },
    { "que": "How do criminalisation of politics affect democracy?", "ans": "When candidates with criminal records enter politics, it undermines rule of law and governance quality." },
    { "que": "What are pressure groups?", "ans": "Organised groups that attempt to influence public policy without contesting elections directly." },
    { "que": "Why is inequality a democratic challenge?", "ans": "Economic inequality limits equal opportunities and political influence for disadvantaged groups." },
    { "que": "What is the significance of free and fair elections?", "ans": "They are essential for legitimacy, accountability and reflecting people’s will." },
    { "que": "How does media bias pose a challenge?", "ans": "Biased or concentrated media can distort information and polarize public opinion." },
    { "que": "What is majoritarianism?", "ans": "When majority groups impose their will without protecting minority rights, undermining inclusive democracy." },
    { "que": "How do weak institutions threaten democracy?", "ans": "They fail to enforce laws, check abuses, or provide services effectively, reducing public trust." },
    { "que": "What is the role of civil society in tackling challenges?", "ans": "They monitor, mobilize public opinion, provide services, and hold rulers accountable." },
    { "que": "How can electoral reforms reduce money power?", "ans": "Transparency in funding, caps on spending and public funding can limit undue financial influence." },
    { "que": "What is elite capture?", "ans": "When political or economic elites disproportionately control institutions and benefits, excluding broader citizens." },
    { "que": "How does communal violence undermine democracy?", "ans": "It disrupts public life, erodes trust and distracts from governance priorities." },
    { "que": "What measures can check criminalization of politics?", "ans": "Stricter candidate scrutiny, speedy trials, and disqualification laws based on convictions." },
    { "que": "How can education combat communal and caste prejudices?", "ans": "By promoting critical thinking, equality, and inclusive historical perspectives in curricula." },
    { "que": "What is the impact of vote-buying?", "ans": "It undermines free choice, distorts representation, and entrenches clientelistic politics." },
    { "que": "Why is transparency in governance important?", "ans": "It enables public scrutiny, reduces corruption, and improves accountability." },
    { "que": "How can independent institutions fight corruption?", "ans": "Anti-corruption agencies, audit offices, and judiciary can investigate and punish abuses impartially." },
    { "que": "What is the challenge posed by declining trust in institutions?", "ans": "Low trust reduces compliance, participation and legitimacy of democratic decisions." },
    { "que": "How does globalization pose challenges to democracy?", "ans": "Economic decisions by global actors can limit national policy space and create inequality pressures." },
    { "que": "What role can technology play in addressing democratic challenges?", "ans": "E-governance can increase transparency and participation, but misinformation online is a new risk." },
    { "que": "How can inclusive policies reduce social fragmentation?", "ans": "By ensuring representation, rights protection, and equitable resource distribution for all groups." },
    { "que": "What is the importance of timely justice in strengthening democracy?", "ans": "Speedy and fair justice maintains rule of law and public faith in institutions." },
    { "que": "Why is electoral integrity crucial for democracy?", "ans": "Integrity ensures that outcomes reflect citizens' choices, maintaining legitimacy and trust." },
    { "que": "What common-sense reforms can improve party behaviour?", "ans": "Party funding transparency, internal democracy, and candidate vetting to reduce criminal and money influence." },
    { "que": "What is the overall message of the 'Challenges to Democracy' chapter?", "ans": "Democracy requires constant strengthening of institutions, civic engagement and reforms to meet social and economic challenges." }
  ]
}