{
  "data": [
    { "que": "What are minerals?", "ans": "Natural substances found in the earth's crust with economic value like coal, iron and bauxite." },
    { "que": "Differentiate between metallic and non-metallic minerals.", "ans": "Metallic yield metals on processing (iron); non-metallic do not (phosphate, limestone)." },
    { "que": "What is ore?", "ans": "Mineral-bearing rock from which valuable substances can be extracted profitably." },
    { "que": "What is energy resource?", "ans": "Resources used to produce energy like coal, petroleum, natural gas and renewable sources." },
    { "que": "Why map mineral resources?", "ans": "To locate deposits and guide extraction and planning." },
    { "que": "What is a reserve in minerals?", "ans": "Portion of mineral deposit that can be mined economically with current technology." },
    { "que": "What is strip mining?", "ans": "Surface mining method where layers are removed to extract minerals near the surface." },
    { "que": "Name a non-renewable energy source.", "ans": "Coal, petroleum and natural gas are non-renewable energy sources." },
    { "que": "What is renewable energy?", "ans": "Energy from sources that are replenished like solar, wind and biomass." },
    { "que": "What is thermal power?", "ans": "Electricity produced by burning fossil fuels to generate steam that drives turbines." },
    { "que": "What is hydropower?", "ans": "Energy generated by harnessing the potential energy of flowing water in dams and rivers." },
    { "que": "Why is coal important for India?", "ans": "Major fuel for thermal power plants and steel production, abundant domestic reserves." },
    { "que": "What are environmental impacts of mining?", "ans": "Deforestation, soil erosion, water pollution and habitat destruction." },
    { "que": "What is offshore oil drilling?", "ans": "Extraction of oil from beneath the seafloor using rigs and platforms." },
    { "que": "What is energy security?", "ans": "Stable and affordable access to energy resources to meet a country's needs." },
    { "que": "What is the role of technology in mining?", "ans": "Improves discovery, extraction efficiency and reduces environmental harm with better practices." },
    { "que": "What is coal gasification?", "ans": "Process of converting coal into gaseous fuels for cleaner use." },
    { "que": "Why diversify energy sources?", "ans": "To reduce dependence on few fuels and enhance energy security and sustainability." },
    { "que": "What is the concept of peak oil?", "ans": "Hypothesis that global oil production will reach a maximum and then decline." },
    { "que": "What is nuclear energy?", "ans": "Energy released from nuclear reactions, used for electricity generation with low carbon emissions." },
    { "que": "What are strategic minerals?", "ans": "Minerals critical for industries and national security like rare earths." },
    { "que": "How does mining affect local communities?", "ans": "Displacement, loss of livelihood but may bring infrastructure and jobs if managed well." },
    { "que": "What is renewable energy's environmental advantage?", "ans": "Lower greenhouse gas emissions compared to fossil fuels." },
    { "que": "What is gas flaring?", "ans": "Burning off natural gas during oil extraction, wasting energy and emitting pollutants." },
    { "que": "What is the role of policies in mineral management?", "ans": "Regulate extraction, ensure environmental safeguards and distribution of benefits." },
    { "que": "Why is exploration important?", "ans": "To discover new deposits and update reserves data for planning." },
    { "que": "What is acid mine drainage?", "ans": "Pollution from mining where sulphide minerals produce acidic runoff contaminating water." },
    { "que": "Give an example of a renewable energy project.", "ans": "A solar PV farm or a wind turbine park generating electricity from sun or wind." },
    { "que": "What is the benefit of distributed renewable energy?", "ans": "Local generation reduces transmission losses and enhances access in remote areas." },
    { "que": "What is sustainable mining practice?", "ans": "Minimising environmental damage, rehabilitating land and ensuring community benefits." }
  ]
}
