{
  "data": [
    { "que": "What is meant by coordination in multicellular organisms?", "ans": "Integration of functions and responses between organs and systems." },
    { "que": "Name the two main regulatory systems in animals.", "ans": "Nervous system and endocrine (hormonal) system." },
    { "que": "What is a neuron?", "ans": "A nerve cell that transmits electrical impulses." },
    { "que": "Define synapse.", "ans": "Junction between two neurons where impulses pass chemically." },
    { "que": "What is a reflex action?", "ans": "A rapid, involuntary response to a stimulus without conscious control." },
    { "que": "Give an example of a reflex action.", "ans": "Removal of hand from a hot object (withdrawal reflex)." },
    { "que": "What are receptors?", "ans": "Specialised cells or organs that detect stimuli from the environment." },
    { "que": "What is an effector?", "ans": "A muscle or gland that produces a response to a stimulus." },
    { "que": "Name the parts of a neuron.", "ans": "Cell body, dendrites, and axon." },
    { "que": "What is the role of myelin sheath?", "ans": "Insulates axon and speeds up impulse conduction." },
    { "que": "Differentiate between sensory and motor neurons.", "ans": "Sensory neurons carry impulses to the CNS; motor neurons carry impulses away to effectors." },
    { "que": "What is the central nervous system (CNS)?", "ans": "Brain and spinal cord that process information." },
    { "que": "What is the peripheral nervous system (PNS)?", "ans": "All nerves outside the brain and spinal cord connecting CNS to organs." },
    { "que": "What is the function of the spinal cord?", "ans": "Transmits impulses and coordinates simple reflexes." },
    { "que": "Name the three layers of meninges briefly.", "ans": "Dura mater, arachnoid, and pia mater — protective coverings of the CNS." },
    { "que": "What is a stimulus?", "ans": "Any change in the environment that elicits a response from an organism." },
    { "que": "What is the endocrine system?", "ans": "A system of glands that secrete hormones into the blood." },
    { "que": "Give two examples of endocrine glands.", "ans": "Pituitary gland and thyroid gland." },
    { "que": "What are hormones?", "ans": "Chemical messengers released by endocrine glands carried by blood." },
    { "que": "State one function of the pituitary gland.", "ans": "Controls other endocrine glands by releasing regulating hormones." },
    { "que": "How does the endocrine response differ from nervous response?", "ans": "Endocrine is slower but longer-lasting; nervous is rapid but short-lived." },
    { "que": "What is feedback regulation?", "ans": "Mechanism where hormone levels are regulated by feedback to maintain balance." },
    { "que": "What causes watery eyes when onion is cut?", "ans": "Stimulation of tear glands by irritant vapours activating reflex pathways." },
    { "que": "Define voluntary action.", "ans": "A deliberate action under conscious control, e.g., walking." },
    { "que": "What is the role of cerebrum?", "ans": "Higher brain functions — thinking, memory, and voluntary actions." },
    { "que": "What is the role of cerebellum?", "ans": "Coordinates posture and balance and fine muscle movements." },
    { "que": "Why are reflex arcs important?", "ans": "They protect the body by producing rapid automatic responses to danger." },
    { "que": "Mention one example of hormonal coordination in plants.", "ans": "Auxin controls phototropism causing plant stems to bend toward light." }
  ]
}
