{
  "data": [
    { "que": "What is economic development?", "ans": "A process of improving the economic well-being and quality of life of a population." },
    { "que": "Differentiate between economic growth and economic development.", "ans": "Growth is increase in output (GDP); development includes structural changes and welfare improvements." },
    { "que": "What is GDP?", "ans": "Gross Domestic Product: total value of goods and services produced in a country in a year." },
    { "que": "What is per capita income?", "ans": "Average income per person in a country, calculated by dividing national income by population." },
    { "que": "Why is per capita income not a perfect measure of development?", "ans": "It ignores income distribution, non-monetary factors, and quality of life." },
    { "que": "Name two social indicators of development.", "ans": "Literacy rate and life expectancy." },
    { "que": "What is Human Development Index (HDI)?", "ans": "A composite index of life expectancy, education, and per capita income indicators." },
    { "que": "Why are non-economic factors important for development?", "ans": "They affect people's well-being, opportunities, and quality of life beyond income." },
    { "que": "Define informal sector.", "ans": "Small-scale, unregistered economic activities often without social security." },
    { "que": "Give an example of informal sector employment.", "ans": "Street vendors and rickshaw pullers." },
    { "que": "What is structural change in development?", "ans": "Shift of workforce and output from agriculture to industry and services." },
    { "que": "Why is education important for development?", "ans": "It improves skills, productivity, and access to better jobs." },
    { "que": "How does healthcare contribute to development?", "ans": "Improves life expectancy and productivity by reducing illness and mortality." },
    { "que": "What is unemployment rate?", "ans": "Percentage of labour force that is willing and able to work but cannot find jobs." },
    { "que": "What is underemployment?", "ans": "When people work less than they would like or in jobs below their skill level." },
    { "que": "Explain income inequality.", "ans": "Unequal distribution of income across individuals or groups in society." },
    { "que": "What role does infrastructure play in development?", "ans": "Facilitates production, trade, and access to services, boosting growth." },
    { "que": "Define sustainable development.", "ans": "Development that meets present needs without compromising future generations' ability to meet theirs." },
    { "que": "What is poverty line?", "ans": "A threshold income below which a person is considered poor." },
    { "que": "Name a method to measure poverty.", "ans": "Headcount ratio (proportion of population below poverty line)." },
    { "que": "What is inclusive growth?", "ans": "Economic growth that benefits all sections of society, especially the poor." },
    { "que": "Why is agricultural productivity important?", "ans": "Higher productivity raises incomes, food security, and frees labour for other sectors." },
    { "que": "What is foreign direct investment (FDI)?", "ans": "Investment by foreign firms in domestic productive assets or businesses." },
    { "que": "How does globalization affect development?", "ans": "It can bring investment and technology but may increase competition and inequality." },
    { "que": "What is the role of government in development?", "ans": "Provide public goods, regulation, social services, and redistribute resources." },
    { "que": "Define standard of living.", "ans": "Level of wealth, comfort, and access to goods and services enjoyed by individuals." },
    { "que": "What is the significance of employment generation?", "ans": "Creates income, reduces poverty, and improves human development." },
    { "que": "How does technology contribute to development?", "ans": "Increases productivity, creates new industries, and improves services." },
    { "que": "Mention one limitation of using GDP to compare countries.", "ans": "Differences in cost of living and uncounted informal activities distort comparisons." },
    { "que": "Why is gender equality important for development?", "ans": "Ensures equal opportunities and increases overall productivity and welfare." }
  ]
}
