{
  "data": [
    { "que": "What is print culture?", "ans": "The spread and influence of printed materials like books and newspapers on society." },
    { "que": "Who invented the movable-type printing press?", "ans": "Johannes Gutenberg is credited with introducing movable type printing in Europe." },
    { "que": "How did print culture affect literacy?", "ans": "Increased availability of printed texts made literacy more useful and encouraged reading." },
    { "que": "What was the significance of vernacular languages in print?", "ans": "Printing in vernaculars widened readership and helped form regional and national identities." },
    { "que": "How did newspapers shape public opinion?", "ans": "They disseminated news and ideas, creating a public sphere for debate and nationalism." },
    { "que": "What role did print play in the spread of reformist ideas?", "ans": "Pamphlets and books circulated ideas about rights, democracy, and social change." },
    { "que": "Give an example of a print form that spread popular culture.", "ans": "Chapbooks, ballads, and serialized novels that reached wide popular audiences." },
    { "que": "What is censorship?", "ans": "The control or suppression of printed material by authorities to limit dissenting ideas." },
    { "que": "How did print support nationalist movements?", "ans": "Printing standardized languages, spread nationalist narratives, and mobilized people." },
    { "que": "What is the 'public sphere'?", "ans": "A space where citizens discuss and form public opinion, often via print media." },
    { "que": "Why were literacy campaigns important?", "ans": "They increased access to print and empowered more people to participate in public debates." },
    { "que": "What is an almanac?", "ans": "A yearly publication with calendars, information, and news for general readers." },
    { "que": "How did cheap print materials affect consumption of texts?", "ans": "Lower costs allowed mass circulation and a wider variety of readers to access printed works." },
    { "que": "Name a political use of print in the 19th century.", "ans": "Political pamphlets and newspapers mobilized support for reforms and national causes." },
    { "que": "What is a serialized novel?", "ans": "A novel published in regular installments in newspapers or magazines." },
    { "que": "How did advertising influence print culture?", "ans": "Ads made print financially viable and linked consumer culture with printed media." },
    { "que": "What is the link between print and education?", "ans": "Printed textbooks standardized learning and curricula across regions." },
    { "que": "How did colonial authorities use print?", "ans": "To circulate official information, laws, and to shape colonial narratives." },
    { "que": "What role did missionaries play in print culture?", "ans": "They printed religious texts and promoted literacy in local languages." },
    { "que": "What is 'printing in vernaculars' significance for identity?", "ans": "It helped form distinct linguistic communities and political identities." },
    { "que": "Give an example of resistance to print control.", "ans": "Underground pamphlets, secret newsletters, and clandestine presses during movements for freedom." },
    { "que": "How did technological advances change printing in the 19th century?", "ans": "Steam-powered presses increased speed and reduced cost, enabling mass production of print." },
    { "que": "What is sheet music's role in print culture?", "ans": "It helped disseminate popular songs and folk tunes across regions." },
    { "que": "Why did governments regulate print materials?", "ans": "To maintain order, control dissent, and protect official versions of events." },
    { "que": "How did print culture affect women's roles?", "ans": "Access to printed works enabled women's education and participation in reform movements." },
    { "que": "What is a pamphlet?", "ans": "A short printed work used to argue a political or social position." },
    { "que": "How did local periodicals contribute to nationalism?", "ans": "By publishing articles in local languages that discussed national history and grievances." },
    { "que": "What is the relationship between print and censorship laws?", "ans": "Censorship laws attempted to limit dissent but often stimulated alternative print networks." }
  ]
}