{
  "data": [
    { "que": "Define reproduction.", "ans": "Biological process by which organisms produce offspring." },
    { "que": "What is asexual reproduction?", "ans": "Reproduction without fusion of gametes; offspring genetically identical." },
    { "que": "Give two examples of asexual reproduction.", "ans": "Binary fission in amoeba and budding in hydra." },
    { "que": "What is sexual reproduction?", "ans": "Involves fusion of male and female gametes to form a zygote." },
    { "que": "Define gamete.", "ans": "Specialised reproductive cell (sperm or egg) involved in sexual reproduction." },
    { "que": "What is fertilisation?", "ans": "Fusion of male and female gametes to form a zygote." },
    { "que": "Differentiate between internal and external fertilisation.", "ans": "Internal: inside body (e.g., mammals); external: outside body in water (e.g., fishes)." },
    { "que": "What is a zygote?", "ans": "Diploid cell formed by fusion of gametes; begins development into embryo." },
    { "que": "What are ovulation and menstruation?", "ans": "Ovulation: release of ovum; menstruation: shedding of uterine lining if no fertilisation." },
    { "que": "What is pollination?", "ans": "Transfer of pollen from anther to stigma in flowering plants." },
    { "que": "Differentiate self-pollination and cross-pollination.", "ans": "Self: pollen to same flower/plant; cross: pollen to different plant of same species." },
    { "que": "What is vegetative propagation?", "ans": "Asexual reproduction in plants using vegetative parts like stems, roots, leaves." },
    { "que": "Give one advantage of sexual reproduction.", "ans": "Generates variation which aids adaptation and evolution." },
    { "que": "Give one advantage of asexual reproduction.", "ans": "Rapid population increase without the need for mating." },
    { "que": "What are testes and ovaries?", "ans": "Male and female reproductive organs producing sperm and ova respectively." },
    { "que": "What is cloning?", "ans": "Production of genetically identical individuals artificially from a single cell." },
    { "que": "What is embryo?", "ans": "Early developmental stage after zygote division leading to a new organism." },
    { "que": "What is metamorphosis?", "ans": "Major change in form during development (e.g., caterpillar to butterfly)." },
    { "que": "Why is genetic variation important in sexual reproduction?", "ans": "Provides diverse traits which improve survival under changing conditions." },
    { "que": "What is insemination?", "ans": "Introduction of semen into the female reproductive tract." },
    { "que": "What is a placenta?", "ans": "Organ in pregnant mammals that supplies nutrients and oxygen to the fetus." },
    { "que": "Name a reproductive adaptation in plants for pollination.", "ans": "Bright flowers to attract pollinators like insects and birds." },
    { "que": "What are gametophyte and sporophyte?", "ans": "Alternating generations in plants: gametophyte produces gametes, sporophyte produces spores." },
    { "que": "What is parthenogenesis?", "ans": "Development of an egg without fertilisation (seen in some insects)." },
    { "que": "Why do organisms reproduce sexually?", "ans": "To create offspring with genetic variation and adaptability." }
  ]
}
