{
  "data": [
    { "que": "What is money?", "ans": "A commonly accepted medium of exchange for goods and services." },
    { "que": "List three functions of money.", "ans": "Medium of exchange, unit of account, store of value." },
    { "que": "What is liquidity?", "ans": "Ease with which an asset can be converted into cash without loss of value." },
    { "que": "What is credit?", "ans": "Agreement to receive goods or money now and pay later." },
    { "que": "Name a formal source of credit.", "ans": "Banks and cooperatives." },
    { "que": "Name an informal source of credit.", "ans": "Moneylenders and family." },
    { "que": "What is interest?", "ans": "Price paid for borrowing money, usually a percentage of the loan." },
    { "que": "What is collateral?", "ans": "An asset pledged to secure a loan." },
    { "que": "Why do farmers need credit?", "ans": "To buy seeds, fertilisers and other inputs before harvest." },
    { "que": "What is meant by formal credit?", "ans": "Loans from regulated institutions with documented procedures." },
    { "que": "What is self-help group (SHG) credit?", "ans": "Small groups saving together and accessing loans collectively." },
    { "que": "Define microcredit.", "ans": "Small loans to poor people for income-generating activities." },
    { "que": "Why can informal credit be expensive?", "ans": "High interest rates and lack of regulation lead to costly borrowing." },
    { "que": "What is trade credit?", "ans": "Credit extended by suppliers to buyers to pay later." },
    { "que": "How does credit support entrepreneurship?", "ans": "Provides funds to start and expand small businesses." },
    { "que": "What is overdraft facility?", "ans": "Bank allows withdrawal beyond account balance up to a limit." },
    { "que": "What is a bank's role in the economy?", "ans": "Mobilise savings and provide loans for investment and consumption." },
    { "que": "What is interest rate risk?", "ans": "Risk of losses if interest rates change unfavorably for borrowers or lenders." },
    { "que": "What is collateralisation's purpose?", "ans": "Reduces lender's risk and encourages lending to riskier borrowers." },
    { "que": "Why encourage formal credit in rural areas?", "ans": "To reduce dependence on exploitative moneylenders and lower costs." },
    { "que": "What is financial inclusion?", "ans": "Ensuring access to affordable financial services for all sections of society." },
    { "que": "Name one instrument of money.", "ans": "Currency notes and coins." },
    { "que": "What is a bank loan?", "ans": "A sum of money provided by a bank to be repaid with interest." },
    { "que": "Why is credit appraisal important?", "ans": "To assess borrower’s ability to repay and reduce default risk." },
    { "que": "What is a default?", "ans": "Failure to repay a loan as per agreed terms." },
    { "que": "How does insurance relate to credit?", "ans": "Protects borrowers/lenders against specific risks reducing credit losses." },
    { "que": "What is the role of cooperatives in credit?", "ans": "Provide accessible loans to members, especially in rural areas." },
    { "que": "Why regulate money supply?", "ans": "To control inflation and stabilise the economy." },
    { "que": "What is a gold loan?", "ans": "Loan secured by pledging gold as collateral." },
    { "que": "Give one benefit of formal banking for the poor.", "ans": "Access to lower-cost loans and safer savings." }
  ]
}
