{
  "data": [
    { "que": "What are consumer rights?", "ans": "Legal protections ensuring safety, information, choice and redress for buyers of goods and services." },
    { "que": "Name the four basic consumer rights.", "ans": "Right to safety, information, choice and redress." },
    { "que": "What is the Consumer Protection Act?", "ans": "Law that protects consumer interests and provides mechanisms for grievance redressal." },
    { "que": "What is misleading advertisement?", "ans": "False or deceptive promotion about a product's quality or features." },
    { "que": "What should a consumer do before buying expensive goods?", "ans": "Check warranty, compare prices, and read product information and reviews." },
    { "que": "What is warranty?", "ans": "A promise by seller/manufacturer to repair or replace a defective product within a period." },
    { "que": "What is guarantee?", "ans": "A seller's assurance regarding product quality, sometimes used interchangeably with warranty." },
    { "que": "What is consumer forum?", "ans": "Legal body where consumers can file complaints against sellers or service providers." },
    { "que": "What is redressal?", "ans": "Remedy provided to consumers for defective goods or deficient services, like refund or replacement." },
    { "que": "Who is a consumer?", "ans": "A person who buys goods or hires services for personal use and not for resale." },
    { "que": "What is unfair trade practice?", "ans": "Deceptive or exploitative business actions like false claims or hidden charges." },
    { "que": "Why keep purchase receipts?", "ans": "They serve as proof of purchase for warranty claims and complaints." },
    { "que": "What is product label information?", "ans": "Details like ingredients, manufacturing date, expiry date and usage instructions." },
    { "que": "What is right to information?", "ans": "Consumers must be informed about product quality, price and terms before purchase." },
    { "que": "What agencies help consumers?", "ans": "Consumer forums, consumer organisations, Bureau of Indian Standards (BIS)." },
    { "que": "How to file a complaint?", "ans": "Collect evidence, write a complaint, file at consumer forum or use online portals." },
    { "que": "What is inflation's effect on consumers?", "ans": "Reduces purchasing power by raising prices of goods and services." },
    { "que": "What is product recall?", "ans": "Withdrawal of a product by manufacturer due to safety defects or hazards." },
    { "que": "Why consumer education matters?", "ans": "It empowers buyers to make informed choices and seek redress when needed." },
    { "que": "What is sale on approval?", "ans": "Buyer can return goods after trial if unsatisfied under agreed terms." },
    { "que": "What documents help in consumer complaint?", "ans": "Bill, warranty card, test reports, emails and photographs of defects." },
    { "que": "What is price?", "ans": "Amount paid by a buyer to acquire a good or service." },
    { "que": "What is consumer responsibility?", "ans": "To use products safely, read instructions, and pay bills honestly." },
    { "que": "How do consumer organisations help?", "ans": "They create awareness, assist in complaints and conduct product tests." },
    { "que": "What is exchange policy?", "ans": "Seller's terms for returning or exchanging goods within a period." },
    { "que": "What is the role of BIS?", "ans": "Sets quality standards and certifies products for safety and reliability in India." },
    { "que": "How to avoid online shopping fraud?", "ans": "Use secure sites, check seller reviews, and avoid sharing sensitive data." },
    { "que": "What is cooling-off period?", "ans": "Time during which consumer can cancel certain transactions without penalty." },
    { "que": "What is the benefit of product testing?", "ans": "Identifies safety issues and helps consumers make safer choices." }
  ]
}
