{
  "data": [
    { "que": "What is nationalism?", "ans": "A sense of shared identity and desire for self-government among a group of people." },
    { "que": "Which event in 1789 influenced European national movements?", "ans": "The French Revolution." },
    { "que": "Name one idea spread by the French Revolution that promoted nationalism.", "ans": "Ideas of liberty, equality, and fraternity." },
    { "que": "What role did language play in the rise of nationalism?", "ans": "Shared language helped form collective identity and cultural unity." },
    { "que": "Define nation-state.", "ans": "A political unit where the boundaries of a nation coincide with the state." },
    { "que": "Who was Giuseppe Mazzini?", "ans": "An Italian nationalist who promoted the idea of a united Italy and founded Young Italy." },
    { "que": "What was the significance of the 1848 revolutions?", "ans": "They were widespread uprisings demanding national unification and liberal reforms." },
    { "que": "Name one method used by nationalists to mobilize people.", "ans": "Use of newspapers, songs, and public meetings to spread nationalist ideas." },
    { "que": "How did Romanticism influence nationalism?", "ans": "Romanticism emphasized folk culture and history, strengthening national pride." },
    { "que": "Who was Otto von Bismarck?", "ans": "Prussian chancellor who used realpolitik to unify Germany." },
    { "que": "What is 'realpolitik'?", "ans": "Politics based on practical and material factors rather than ideology or ethics." },
    { "que": "Which war helped German unification in 1871?", "ans": "The Franco-Prussian War (1870–71)." },
    { "que": "What was the role of the middle class in nationalist movements?", "ans": "They provided leadership, resources, and demand for political participation." },
    { "que": "Give an example of cultural nationalism.", "ans": "The Grimm brothers collecting folk tales to highlight German cultural unity." },
    { "que": "Why did multinational empires face challenges from nationalism?", "ans": "Different national groups within empires sought self-determination." },
    { "que": "Name one multinational empire affected by nationalism.", "ans": "The Austro-Hungarian Empire." },
    { "que": "What was the Young Italy movement?", "ans": "A movement founded by Mazzini aimed at Italian unification by popular uprising." },
    { "que": "How did economic changes contribute to nationalism?", "ans": "Industrialization created new social groups and communication networks that spread nationalist ideas." },
    { "que": "What is irredentism?", "ans": "A political movement to reclaim and reoccupy a 'lost' or 'unredeemed' homeland." },
    { "que": "Name a leader associated with Italian unification besides Mazzini.", "ans": "Count Camillo di Cavour or Giuseppe Garibaldi." },
    { "que": "What was Garibaldi's role in Italian unification?", "ans": "He led volunteer forces (the Red Shirts) to liberate southern Italy and support unification." },
    { "que": "How did print culture help nationalist movements?", "ans": "Newspapers and books spread ideas and created a common public sphere." },
    { "que": "What is self-determination?", "ans": "The principle that peoples should choose their own political status." },
    { "que": "Why were symbols important for nationalism?", "ans": "Flags, anthems, and monuments fostered collective identity and loyalty." },
    { "que": "What was the outcome of German unification?", "ans": "The proclamation of the German Empire in 1871 with the Prussian king as emperor." },
    { "que": "Give an example of a national movement that used violence.", "ans": "Garibaldi's military campaigns in Italy; revolutionary uprisings of 1848." },
    { "que": "How did education contribute to nationalism?", "ans": "Standardized curriculum and language taught a shared national history and values." },
    { "que": "What were the limitations of 19th-century nationalism?", "ans": "It sometimes led to exclusion of minorities and justification for wars or imperialism." }
  ]
}