{
  "data": [
    { "que": "What is water resource?", "ans": "Freshwater sources like rivers, lakes, groundwater used for drinking, irrigation and industry." },
    { "que": "What is groundwater?", "ans": "Water stored beneath the earth's surface in pores and fractures of rock and soil." },
    { "que": "Define watershed.", "ans": "Area of land draining into a common water body like a river or reservoir." },
    { "que": "What is water table?", "ans": "Upper surface of saturated zone where groundwater pressure is equal to atmospheric pressure." },
    { "que": "What is over-extraction of groundwater?", "ans": "Removing groundwater faster than it is replenished, causing shortages and drop in water table." },
    { "que": "What is rainwater harvesting?", "ans": "Collecting and storing rainwater for later use and to recharge groundwater." },
    { "que": "Why are rivers important?", "ans": "Provide water for irrigation, transport, hydropower and support ecosystems." },
    { "que": "What is canal irrigation?", "ans": "Supply of water to fields through man-made channels from rivers or reservoirs." },
    { "que": "What is drip irrigation?", "ans": "Water-saving method that delivers water directly to plant roots in small quantities." },
    { "que": "What causes river pollution?", "ans": "Industrial discharge, sewage, agricultural runoff and solid waste dumping." },
    { "que": "What is desalination?", "ans": "Process of removing salt from seawater to obtain fresh water." },
    { "que": "Why manage watersheds?", "ans": "To maintain water availability, prevent soil erosion and support livelihoods." },
    { "que": "What is multipurpose river valley project?", "ans": "Project combining irrigation, hydropower, flood control and water supply functions." },
    { "que": "What is the role of dams?", "ans": "Store water, regulate river flow, provide irrigation and generate hydroelectricity." },
    { "que": "What is water scarcity?", "ans": "Insufficient water to meet demands of population and activities in an area." },
    { "que": "What is virtual water?", "ans": "Water embedded in production of goods, e.g., water used to grow crops or manufacture products." },
    { "que": "How does deforestation affect water resources?", "ans": "Reduces infiltration and increases runoff causing soil erosion and reduced groundwater recharge." },
    { "que": "What is saline water intrusion?", "ans": "Sea water entering freshwater aquifers due to over-extraction near coasts." },
    { "que": "What is watershed management?", "ans": "Integrated management of land and water resources in a watershed for sustainability." },
    { "que": "Why is equitable water distribution important?", "ans": "To ensure fair access for agriculture, domestic use and industry and reduce conflicts." },
    { "que": "What is floodplain?", "ans": "Flat area near a river periodically flooded, often fertile for agriculture." },
    { "que": "How does pollution affect groundwater?", "ans": "Contaminants percolate into aquifers, making water unsafe and costly to treat." },
    { "que": "What is integrated water resources management (IWRM)?", "ans": "Coordinated development and management of water, land and related resources for equitable use." },
    { "que": "Why are wetlands important?", "ans": "They store water, support biodiversity and purify pollutants." },
    { "que": "What is conjunctive use of water?", "ans": "Combined use of surface and groundwater to maximise benefits and reduce shortages." },
    { "que": "What are water conflicts?", "ans": "Disputes between users, regions or countries over allocation and use of water resources." },
    { "que": "How can cities conserve water?", "ans": "Leak detection, recycling wastewater, rainwater harvesting and efficient appliances." },
    { "que": "What is role of monitoring in water management?", "ans": "Track quality and quantity to guide allocation, treatment and conservation measures." },
    { "que": "What is watershed recharge?", "ans": "Process of water percolating to replenish aquifers." },
    { "que": "Name a non-conventional water source.", "ans": "Reclaimed wastewater or desalinated seawater." }
  ]
}
