{
  "data": [
    { "que": "What is a natural resource?", "ans": "Materials or components that occur in nature and are useful to humans." },
    { "que": "Define conservation of natural resources.", "ans": "Sustainable use and protection of natural resources to prevent depletion." },
    { "que": "Give two examples of renewable resources.", "ans": "Solar energy and forests (if managed sustainably)." },
    { "que": "Give two examples of non-renewable resources.", "ans": "Coal and petroleum." },
    { "que": "What is watershed management?", "ans": "Conservation and proper use of water and land in a watershed to prevent runoff and erosion." },
    { "que": "Why is afforestation important?", "ans": "Increases forest cover, prevents soil erosion, and maintains ecological balance." },
    { "que": "What is sustainable agriculture?", "ans": "Farming that maintains productivity while conserving resources and biodiversity." },
    { "que": "What are biological resources?", "ans": "Plants, animals and microorganisms used for food, medicine, and other purposes." },
    { "que": "What is overexploitation?", "ans": "Excessive use of resources beyond their recovery capacity." },
    { "que": "How can water resources be conserved?", "ans": "Rainwater harvesting, efficient irrigation, and watershed management." },
    { "que": "What is soil conservation?", "ans": "Practices like contour ploughing and terracing to reduce erosion and maintain fertility." },
    { "que": "Define biodiversity briefly.", "ans": "Variety of all life forms in an area including species and ecosystems." },
    { "que": "Why is biodiversity important?", "ans": "Provides ecosystem services, resources, and resilience against changes." },
    { "que": "What is integrated resource management?", "ans": "Coordinated management of land, water, and biological resources for sustainability." },
    { "que": "What role do local communities play in resource management?", "ans": "They contribute traditional knowledge and help implement conservation practices." },
    { "que": "What is the effect of deforestation on climate?", "ans": "Leads to increased CO2, reduced rainfall, and local temperature changes." },
    { "que": "What is renewable energy?", "ans": "Energy from sources that are replenished like solar, wind, and hydro." },
    { "que": "What is the precautionary principle in resource management?", "ans": "Avoiding actions that may cause severe or irreversible harm when scientific knowledge is uncertain." },
    { "que": "What is the role of government in resource conservation?", "ans": "Formulate policies, enforce laws, and support conservation programs." },
    { "que": "Name one method to conserve forests.", "ans": "Afforestation and controlled logging with replanting." },
    { "que": "How does pollution affect natural resources?", "ans": "Contaminates water, soil, and air, reducing their usability and harming ecosystems." },
    { "que": "What is community-based conservation?", "ans": "Conservation managed with active participation of local people." },
    { "que": "Why is fuelwood management important in rural areas?", "ans": "Prevents deforestation and ensures sustainable fuel supply." },
    { "que": "What is habitat restoration?", "ans": "Reviving degraded ecosystems to their natural condition." },
    { "que": "Give an example of an international effort for resource conservation.", "ans": "The Convention on Biological Diversity (CBD)." },
    { "que": "Why is monitoring important in resource management?", "ans": "To track changes, assess effectiveness, and adjust strategies." }
  ]
}
