{
  "data": [
    { "que": "What are the three main sectors of the economy?", "ans": "Primary (agriculture), secondary (industry), and tertiary (services)." },
    { "que": "Define primary sector.", "ans": "Activities that directly use natural resources like farming, fishing and mining." },
    { "que": "Define secondary sector.", "ans": "Activities that process primary products into finished goods, like manufacturing." },
    { "que": "Define tertiary sector.", "ans": "Services like transport, banking, education and healthcare." },
    { "que": "Give an example of primary sector activity.", "ans": "Cultivation of crops or fishing." },
    { "que": "Give an example of secondary sector activity.", "ans": "Textile manufacturing or steel production." },
    { "que": "Give an example of tertiary sector activity.", "ans": "Banking services or hospital care." },
    { "que": "What is sectoral composition of GDP?", "ans": "Share of GDP contributed by primary, secondary and tertiary sectors." },
    { "que": "How does employment share compare across sectors in India?", "ans": "A large share of employment is in agriculture while services contribute most to GDP." },
    { "que": "What is disguised unemployment?", "ans": "When more people are employed than needed, especially in agriculture, without contributing to output." },
    { "que": "Why does productivity differ across sectors?", "ans": "Due to differences in capital, technology and skill intensity." },
    { "que": "What is mechanisation?", "ans": "Use of machines to increase productivity in agriculture and industry." },
    { "que": "How does industrialisation affect employment?", "ans": "Creates non-farm jobs and absorbs surplus agricultural labour." },
    { "que": "What are service exports?", "ans": "Services sold to other countries like IT and tourism." },
    { "que": "Why is diversification of economy important?", "ans": "Reduces dependence on one sector and vulnerability to shocks." },
    { "que": "What is the role of MSMEs?", "ans": "Provide employment and contribute to production and exports." },
    { "que": "Define organised sector.", "ans": "Enterprises registered with government, following regulations and providing social security." },
    { "que": "Define unorganised sector.", "ans": "Small, unregistered enterprises with informal employment and no social security." },
    { "que": "How has services sector grown in India?", "ans": "Rapidly, driven by IT, finance and communications, contributing large GDP share." },
    { "que": "Why is agriculture still important in India?", "ans": "It provides food security and livelihoods for a large rural population." },
    { "que": "What is rural-urban migration?", "ans": "Movement of people from villages to cities in search of jobs and services." },
    { "que": "How do government policies support sectors?", "ans": "Through subsidies, infrastructure, credit and training programs." },
    { "que": "What is value addition?", "ans": "Increasing product value through processing and manufacturing." },
    { "que": "How does skill development help sectors?", "ans": "Improves employability and productivity in industry and services." },
    { "que": "What is the significance of export-led growth?", "ans": "Exports create demand and can spur industrial expansion and jobs." },
    { "que": "Why focus on rural development?", "ans": "To reduce poverty, improve livelihoods and curb migration pressures." },
    { "que": "What is sectoral shift during development?", "ans": "Movement of workforce from primary to secondary and tertiary sectors." },
    { "que": "How does infrastructure benefit all sectors?", "ans": "By improving connectivity, reducing costs and increasing access to markets." },
    { "que": "Name one challenge for MSMEs.", "ans": "Limited access to formal credit and technology." },
    { "que": "Why measure employment across sectors?", "ans": "To design policies for job creation and social protection." }
  ]
}
