{
  "data": [
    { "que": "What is development?", "ans": "A process of improving people's well-being through economic and social progress." },
    { "que": "What is the difference between developed and developing countries?", "ans": "Developed countries have higher per capita income, better infrastructure and social indicators than developing ones." },
    { "que": "Why is HDI used alongside GDP?", "ans": "HDI captures health and education besides income, offering a broader measure of development." },
    { "que": "What is poverty?", "ans": "State where people lack basic necessities like food, shelter, and healthcare." },
    { "que": "Define headcount ratio.", "ans": "Proportion of population living below the poverty line." },
    { "que": "What is quality of life?", "ans": "Overall well-being including health, comfort, and happiness." },
    { "que": "Give two indicators of quality of life.", "ans": "Literacy rate and life expectancy." },
    { "que": "What is public expenditure?", "ans": "Government spending on public goods and services like education and health." },
    { "que": "How does education promote development?", "ans": "By improving skills, productivity and employability." },
    { "que": "What is gender disparity?", "ans": "Unequal treatment or opportunities between genders." },
    { "que": "Mention one method to reduce poverty.", "ans": "Providing social safety nets and targeted employment schemes." },
    { "que": "What are human capabilities?", "ans": "Abilities people have to lead lives they value, like literacy and health." },
    { "que": "What is social sector?", "ans": "Part of the economy providing services like education and healthcare." },
    { "que": "Why is nutrition important for development?", "ans": "Good nutrition boosts health, learning and productivity." },
    { "que": "What is child labour?", "ans": "Work done by children that deprives them of education and harms their development." },
    { "que": "How does sanitation affect development?", "ans": "Better sanitation reduces disease and improves productivity." },
    { "que": "What is sustainable livelihood?", "ans": "Means of living that can be maintained without damaging resources or future prospects." },
    { "que": "Name one global indicator for development.", "ans": "Human Development Index (HDI)." },
    { "que": "What role do NGOs play?", "ans": "They provide services, awareness and advocacy for social causes." },
    { "que": "Why is adult literacy important?", "ans": "Improves access to information, jobs and civic participation." },
    { "que": "What is social exclusion?", "ans": "Being left out from mainstream social, economic or political opportunities." },
    { "que": "How can employment be generated?", "ans": "Through public works, small-scale industries and skill programs." },
    { "que": "What is fiscal policy's role in development?", "ans": "Government spending and taxation shape resource allocation and redistribution." },
    { "que": "Define access to credit.", "ans": "Availability of loans and financial services to individuals and businesses." },
    { "que": "What is meant by unequal development?", "ans": "Different regions and groups developing at different rates." },
    { "que": "Why is urbanisation linked to development?", "ans": "Cities offer jobs, services and markets that boost economic opportunities." },
    { "que": "What is the role of technology in development?", "ans": "Enhances productivity, connectivity and service delivery." },
    { "que": "Give an example of a targeted welfare scheme.", "ans": "Public distribution system (PDS) for subsidised food grains." },
    { "que": "Why monitor development indicators?", "ans": "To evaluate progress and design better policies." },
    { "que": "What is the importance of equity in development?", "ans": "Ensures fair distribution of benefits and opportunities across society." }
  ]
}
