{
  "data": [
    { "que": "What is globalisation?", "ans": "Increasing integration of world economies through trade, investment and technology." },
    { "que": "Name one driver of globalisation.", "ans": "Technological advances in transport and communication." },
    { "que": "How has liberalisation affected India?", "ans": "Opened economy to foreign investment and trade since 1991 reforms." },
    { "que": "What is outsourcing?", "ans": "Contracting out services or production to external providers, often in other countries." },
    { "que": "Give an example of outsourcing from India.", "ans": "IT and BPO services provided to foreign companies." },
    { "que": "What is FDI?", "ans": "Foreign Direct Investment; investment by foreign firms in domestic enterprises." },
    { "que": "How can globalisation create jobs?", "ans": "By generating export demand and foreign investment in industries and services." },
    { "que": "How can globalisation hurt local producers?", "ans": "Increased competition may force small producers out if they can't compete." },
    { "que": "What is fair trade?", "ans": "Trade that aims to provide better prices and conditions for producers in developing countries." },
    { "que": "Define tariffs.", "ans": "Taxes on imports used to protect domestic industries or raise revenue." },
    { "que": "What is import liberalisation?", "ans": "Reducing tariffs and barriers to allow more imports." },
    { "que": "Why is quality standards important for exporters?", "ans": "They ensure products meet market requirements and access global markets." },
    { "que": "What is currency convertibility?", "ans": "Ability to exchange domestic currency for foreign currency easily." },
    { "que": "How does globalisation affect consumers?", "ans": "More variety, better quality and competitive prices of goods and services." },
    { "que": "What is technology transfer?", "ans": "Spread of technology from foreign firms to domestic firms through investment and collaboration." },
    { "que": "Why regulate foreign investment?", "ans": "To protect national interests and ensure benefits for domestic economy." },
    { "que": "What is capital flight?", "ans": "Large-scale exit of financial assets from a country to foreign jurisdictions." },
    { "que": "How do trade policies affect development?", "ans": "They shape competitiveness, employment and industry growth through tariffs and incentives." },
    { "que": "What is a balance of payments?", "ans": "Record of all economic transactions between residents of a country and the rest of the world." },
    { "que": "Name one challenge of globalisation for India.", "ans": "Small producers facing competition and potential job displacement." },
    { "que": "How can small producers benefit from globalisation?", "ans": "By improving quality, meeting standards and accessing new markets." },
    { "que": "What is the role of WTO?", "ans": "To regulate international trade rules and resolve trade disputes among countries." },
    { "que": "What is trade liberalisation?", "ans": "Removing barriers to free flow of goods and services across borders." },
    { "que": "How does globalisation influence culture?", "ans": "Leads to exchange of ideas and cultural influences, sometimes cultural homogenisation." },
    { "que": "What is the importance of intellectual property rights?", "ans": "Protects innovations and encourages investment in research and development." },
    { "que": "Why is skill development important in globalisation?", "ans": "To meet demands of global markets for quality and specialised services." },
    { "que": "What is export competitiveness?", "ans": "Ability of domestic firms to sell products successfully in international markets." },
    { "que": "How do trade deficits impact an economy?", "ans": "May require financing from foreign capital and can affect currency stability." },
    { "que": "What is the role of ports and logistics in global trade?", "ans": "They enable efficient movement of goods, lowering trade costs." },
    { "que": "Why is regulation of MNCs important?", "ans": "To ensure fair wages, environmental standards and local benefits." }
  ]
}
